//Баранович Артур
//а) Дописать класс для работы с одномерным массивом. Реализовать конструктор, создающий массив определенного размера и заполняющий массив числами
//от начального значения с заданным шагом. Создать свойство Sum, которое возвращает сумму элементов массива, метод Inverse, возвращающий новый массив
//с измененными знаками у всех элементов массива (старый массив, остается без изменений), метод Multi, умножающий каждый элемент массива на
//определённое число, свойство MaxCount, возвращающее количество максимальных элементов.



massiv obj = new massiv(0, 1, 5);
Console.WriteLine(obj.summ);
class massiv
{ 
    public int[] arr;
    public int summ;
    
    public massiv(int first, int step, int size ) 
    {
        this.arr = new int[size];
        for( int i = 0; i < size; i++)
        {
            this.arr[i] = first;
            first += step;
            this.summ+=this.arr[i];
        }
        
    }













}