//Баранович Артур 
//1. Дан целочисленный массив из 20 элементов. Элементы массива могут принимать целые значения от –10 000 до 10 000 включительно. Заполнить
//случайными числами. Написать программу, позволяющую найти и вывести количество пар элементов массива, в которых только одно число делится на 3.
//В данной задаче под парой подразумевается два подряд идущих элемента массива.

int [] array = new int [20];
Random rnd = new Random();
int s = 0;
for (int i = 0; i < array.Length; i++)
{ 
    array[i] = rnd.Next(-10001, 10001); 
}
for (int i = 0; i < array.Length - 1; i++)
{
    if ((array[i] % 3 == 0 && array[i + 1] % 3 != 0) | (array[i] % 3 != 0 && array[i + 1] % 3 == 0))
    {
        s += 1;
    }
}
Console.WriteLine(s);